БухЭксп/InformationRegisters/ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Comment>УПД, УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоКорректировочныйДокумент</Name>
					<Comment>УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВБухучете</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбОстаткахПрослеживаемыхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбесценениеВнеоборотныхАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.СправкиНДФЛДляПередачиВНалоговыйОрган</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхождениях</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПредметовЛизинга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОператораСистемыПлатон</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбУменьшенииНалогаПоПатенту</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеДОППВДекларацииПоКосвеннымНалогам</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОплатыОсновныхСредствДляУСН</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаМатериаловВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияЭкспорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДепонированиеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПеней</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеТуристическогоНалога</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДепонированнойЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьНачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияОбъектовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаЗадолженностиНаФакторинг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоМПЗВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.СведенияОбУплатеНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Премия</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОСВАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровВРознице</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрекращениеАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияСБилетом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоОСИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоМПЗИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваровПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСписаниеДепонентовВДоходыОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.КоммерческоеПредложение</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияСИнвестиционнымВычетом</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьДепонированиеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоПрочееВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОборудованияВМонтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерерасчетНДФЛ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОСОтАрендатора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКнигиУчетаДоходовИРасходовИП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоРасчетыВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОплатыОсновныхСредствДляИП</v8:Type>
						<v8:Type>cfg:DocumentRef.РозничнаяПродажа</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЕНС</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияСПатентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СведенияОбУдержанномНДФЛ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНЗП</v8:Type>
						<v8:Type>cfg:DocumentRef.НачалоСтадииРазработокНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартияМатериаловВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыНаОнлайнКассыУменьшающиеНалоги</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьРасчетЕСН</v8:Type>
						<v8:Type>cfg:DocumentRef.УсловияОплатыПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКУДиР</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЕдиномуНалоговомуСчету</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоОСВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереводОСВМалоценноеОборудование</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОПеремещенииПрослеживаемыхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗавершениеРемонтаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоПрочееИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоРасчетыИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУсловийАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/РасчетПоказателейБалансаПоОбязательствамГрафики/Ext/Module.bsl
// Содержимое модуля отличается в версиях ПРОФ и КОРП.
// В версии ПРОФ отсутствует:
// - тело экспортных процедур (остаются только сигнатуры методов)
// - неэкспортные процедуры и все функции.
// Поэтому не допускается реализация в модуле экспортных функций: вместо них следует использовать процедуры с возвращаемым параметром.

#Область СлужебныйПрограммныйИнтерфейс

// Получает графики платежей на дату и дисконтированное обязательство через 12 месяцев
//
// Параметры:
//  ГрафикиПлатежей - см. НовыйГрафикиПлатежей
//  КонтекстРасчета - см. РасчетПоказателейБалансаПоОбязательствам.НовыйКонтекстРасчета
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - можно передать таблицу "РасчетыПоДоговорам" с полями "Контрагент", "ДоговорКонтрагента" для отбора записей
//                          - Неопределено
Процедура ДобавитьТаблицуГрафикиПлатежей(ГрафикиПлатежей, КонтекстРасчета, МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	Если Не КонтекстРасчета.ЕстьДисконтирование Тогда
		Возврат;
	КонецЕсли;
	
	ГрафикиПлатежей = НовыйГрафикиПлатежей();
	
	// Находим последние записи на дату по графику процентных расходов
	// Если у предыдущего графика срок окончания больше, чем у текущего
	// и на момент получения графика текущий закончился, то последняя запись будет из предыдущего графика
	// Поэтому отбираем записи с учетом последнего введенного графика
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Если МенеджерВременныхТаблиц <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	ДатаНачисления =   НачалоДня(КонтекстРасчета.КонецПериодаДата);
	// Добавляем к периоду месяцы, после находим конец месяца для случая: 28.02.2023 --> 29.02.2024
	ДатаНачисления12 = НачалоДня(КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)));
	
	ДатыНачисления = Новый Массив;
	ДатыНачисления.Добавить(ДатаНачисления);
	ДатыНачисления.Добавить(ДатаНачисления12);
	
	Запрос.УстановитьПараметр("Организации",     КонтекстРасчета.Организации);
	Запрос.УстановитьПараметр("Период",          КонтекстРасчета.КонецПериодаДата);
	Запрос.УстановитьПараметр("ДатаНачисления",  ДатаНачисления);
	Запрос.УстановитьПараметр("ДатыНачисления",  ДатыНачисления);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КурсыВалютСрезПоследних.Курс = 0
	|			ТОГДА 1
	|		ИНАЧЕ КурсыВалютСрезПоследних.Курс
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА КурсыВалютСрезПоследних.Кратность = 0
	|			ТОГДА 1
	|		ИНАЧЕ КурсыВалютСрезПоследних.Кратность
	|	КОНЕЦ КАК Кратность,
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиСрезПоследних.Период КАК Период,
	|	ГрафикиСрезПоследних.Регистратор КАК Регистратор,
	|	ГрафикиСрезПоследних.Организация КАК Организация,
	|	ГрафикиСрезПоследних.Контрагент КАК Контрагент,
	|	ГрафикиСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ГрафикиСрезПоследних.ПредметНачисления КАК ПредметНачисления,
	|	СУММА(ВЫБОР
	|			КОГДА ГрафикиСрезПоследних.ДатаНачисления = &ДатаНачисления
	|				ТОГДА 0
	|			ИНАЧЕ ГрафикиСрезПоследних.Обязательство - ГрафикиСрезПоследних.СуммаПлатежа + ГрафикиСрезПоследних.СуммаПроцентов
	|		КОНЕЦ) КАК ДолгосрочноеОбязательство
	|ПОМЕСТИТЬ ОбязательстваПоГрафикам
	|ИЗ
	|	РегистрСведений.ГрафикиПроцентныхРасходов.СрезПоследних(
	|			&Период,
	|			Организация В (&Организации)
	|				И ДатаНачисления В (&ДатыНачисления)) КАК ГрафикиСрезПоследних
	|ГДЕ
	|	&УсловиеКонтрагентыДоговоры
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиСрезПоследних.Период,
	|	ГрафикиСрезПоследних.Регистратор,
	|	ГрафикиСрезПоследних.Организация,
	|	ГрафикиСрезПоследних.Контрагент,
	|	ГрафикиСрезПоследних.ДоговорКонтрагента,
	|	ГрафикиСрезПоследних.ПредметНачисления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	ПредметНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиПроцентныхРасходов.Регистратор КАК Регистратор,
	|	МАКСИМУМ(ГрафикиПроцентныхРасходов.ДатаНачисления) КАК ДатаНачисления
	|ПОМЕСТИТЬ ПоследниеДатыНачисления
	|ИЗ
	|	ОбязательстваПоГрафикам КАК ОбязательстваПоГрафикам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиПроцентныхРасходов КАК ГрафикиПроцентныхРасходов
	|		ПО ОбязательстваПоГрафикам.Регистратор = ГрафикиПроцентныхРасходов.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиПроцентныхРасходов.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиПроцентныхРасходов.Организация КАК Организация,
	|	ГрафикиПроцентныхРасходов.Контрагент КАК Контрагент,
	|	ГрафикиПроцентныхРасходов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ГрафикиПроцентныхРасходов.ПредметНачисления КАК ПредметНачисления,
	|	МАКСИМУМ(ГрафикиПроцентныхРасходов.Период) КАК Период
	|ПОМЕСТИТЬ ПоследниеПериоды
	|ИЗ
	|	ОбязательстваПоГрафикам КАК ОбязательстваПоГрафикам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиПроцентныхРасходов КАК ГрафикиПроцентныхРасходов
	|		ПО ОбязательстваПоГрафикам.Организация = ГрафикиПроцентныхРасходов.Организация
	|			И ОбязательстваПоГрафикам.Контрагент = ГрафикиПроцентныхРасходов.Контрагент
	|			И ОбязательстваПоГрафикам.ДоговорКонтрагента = ГрафикиПроцентныхРасходов.ДоговорКонтрагента
	|			И ОбязательстваПоГрафикам.ПредметНачисления = ГрафикиПроцентныхРасходов.ПредметНачисления
	|			И (ГрафикиПроцентныхРасходов.Период <= &Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиПроцентныхРасходов.Организация,
	|	ГрафикиПроцентныхРасходов.Контрагент,
	|	ГрафикиПроцентныхРасходов.ДоговорКонтрагента,
	|	ГрафикиПроцентныхРасходов.ПредметНачисления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	ПредметНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбязательстваПоГрафикам.Организация КАК Организация,
	|	ОбязательстваПоГрафикам.Регистратор КАК ДокументГрафикиПлатежей,
	|	ОбязательстваПоГрафикам.Контрагент КАК Контрагент,
	|	ОбязательстваПоГрафикам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(ОбязательстваПоГрафикам.ДолгосрочноеОбязательство) КАК ОбязательствоГрафик12,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорыКонтрагентов.Валютный, ЛОЖЬ)
	|			ТОГДА СУММА(ОбязательстваПоГрафикам.ДолгосрочноеОбязательство * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1))
	|		ИНАЧЕ СУММА(ОбязательстваПоГрафикам.ДолгосрочноеОбязательство)
	|	КОНЕЦ КАК ОбязательствоГрафикРуб12,
	|	ЕСТЬNULL(КурсыВалют.Валюта, &ВалютаРеглУчета) КАК ВалютаГрафик,
	|	СРЕДНЕЕ(ЕСТЬNULL(КурсыВалют.Курс, 1)) КАК КурсГрафик,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Валютный, ЛОЖЬ) КАК РасчетыВВалюте,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДокументГрафикиПлатежейДата,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.НомерРегистратора, """") КАК ДокументГрафикиПлатежейНомер,
	|	ЕСТЬNULL(ПоследниеДатыНачисления.ДатаНачисления, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПогашения
	|ИЗ
	|	ОбязательстваПоГрафикам КАК ОбязательстваПоГрафикам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеПериоды КАК ПоследниеПериоды
	|		ПО ОбязательстваПоГрафикам.Период = ПоследниеПериоды.Период
	|			И ОбязательстваПоГрафикам.Организация = ПоследниеПериоды.Организация
	|			И ОбязательстваПоГрафикам.Контрагент = ПоследниеПериоды.Контрагент
	|			И ОбязательстваПоГрафикам.ДоговорКонтрагента = ПоследниеПериоды.ДоговорКонтрагента
	|			И ОбязательстваПоГрафикам.ПредметНачисления = ПоследниеПериоды.ПредметНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеДатыНачисления КАК ПоследниеДатыНачисления
	|		ПО ОбязательстваПоГрафикам.Регистратор = ПоследниеДатыНачисления.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	|			ПО ДоговорыКонтрагентов.ВалютаВзаиморасчетов = КурсыВалют.Валюта
	|		ПО ОбязательстваПоГрафикам.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ОбязательстваПоГрафикам.Регистратор = ДанныеПервичныхДокументов.Документ
	|			И ОбязательстваПоГрафикам.Организация = ДанныеПервичныхДокументов.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбязательстваПоГрафикам.Организация,
	|	ОбязательстваПоГрафикам.Регистратор,
	|	ОбязательстваПоГрафикам.Контрагент,
	|	ОбязательстваПоГрафикам.ДоговорКонтрагента,
	|	ЕСТЬNULL(КурсыВалют.Валюта, &ВалютаРеглУчета),
	|	ДоговорыКонтрагентов.Валютный,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)),
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.НомерРегистратора, """"),
	|	ЕСТЬNULL(ПоследниеДатыНачисления.ДатаНачисления, ДАТАВРЕМЯ(1, 1, 1))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	ДатаПогашения УБЫВ";
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыПоДоговорам") <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеКонтрагентыДоговоры", 
		      "(ГрафикиСрезПоследних.Контрагент, ГрафикиСрезПоследних.ДоговорКонтрагента) В 
		      |(ВЫБРАТЬ РасчетыПоДоговорам.Контрагент, РасчетыПоДоговорам.ДоговорКонтрагента ИЗ РасчетыПоДоговорам)");
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеКонтрагентыДоговоры", "ИСТИНА");
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ГрафикиПлатежей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		
		// если обязательство через 12 месяцев получилось меньше нуля, то считаем равным нулю
		СтрокаТаблицы.ОбязательствоГрафик12    = Макс(СтрокаТаблицы.ОбязательствоГрафик12, 0);
		СтрокаТаблицы.ОбязательствоГрафикРуб12 = Макс(СтрокаТаблицы.ОбязательствоГрафикРуб12, 0);
		
		СтрокаТаблицы.ДокументГрафикиПлатежейПредставление = 
			РасчетПоказателейБалансаПоОбязательствам.ПредставлениеДокумента(
											СтрокаТаблицы.ДокументГрафикиПлатежей,
											СтрокаТаблицы.ДокументГрафикиПлатежейНомер,
											СтрокаТаблицы.ДокументГрафикиПлатежейДата);
	КонецЦикла;
	ГрафикиПлатежей.Индексы.Добавить("Организация, Контрагент, ДоговорКонтрагента");
	
КонецПроцедуры

// Заполняет строку таблицы "АрендныеОбязательства" данными графика
//
// Параметры:
//  СтрокаТаблицы - СтрокаТаблицыЗначений из см. РасчетПоказателейБалансаПоОбязательствам.НовыйАрендныеОбязательства()
//  ГрафикиПлатежей - см. РасчетПоказателейБалансаПоОбязательствамГрафики.НовыйГрафикиПлатежей
//                  - Неопределено - если Не ЕстьДисконтирование
//
Процедура ДополнитьСтрокуДаннымиИзГрафикаПоАренде(СтрокаТаблицы, ГрафикиПлатежей) Экспорт
	
	Если Не ЗначениеЗаполнено(ГрафикиПлатежей) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Организация, Контрагент, ДоговорКонтрагента");
	ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
	
	СтрокиГрафиков = ГрафикиПлатежей.НайтиСтроки(Отбор);
	Если Не ЗначениеЗаполнено(СтрокиГрафиков) Тогда
		Возврат;
	КонецЕсли;
	
	// устанавливаем флаг, если у договора имеется график платежей
	СтрокаТаблицы.ЕстьГрафикПлатежей = Истина;
	
	КоличествоДокументовАренды = 0;
	Обязательство12 = 0;
	ОбязательствоРуб12 = 0;
	ДатаПогашения = Дата(1,1,1);
	Для Каждого СтрокаГрафика Из СтрокиГрафиков Цикл
		КоличествоДокументовАренды = КоличествоДокументовАренды + 1;
		Обязательство12 = Обязательство12 + СтрокаГрафика.ОбязательствоГрафик12;
		ОбязательствоРуб12 = ОбязательствоРуб12 + СтрокаГрафика.ОбязательствоГрафикРуб12;
		Если ДатаПогашения < СтрокаГрафика.ДатаПогашения Тогда
			ДатаПогашения = СтрокаГрафика.ДатаПогашения;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаТаблицы.Обязательство12 = Обязательство12;
	СтрокаТаблицы.ОбязательствоРуб12 = ОбязательствоРуб12;
	СтрокаТаблицы.ДатаПогашения = ДатаПогашения;

	СтрокаГрафика = СтрокиГрафиков[0];

	Если КоличествоДокументовАренды > 1 Тогда
		СтрокаТаблицы.НесколькоДокументовАренды = Истина;
	Иначе
		Если СтрокаТаблицы.РасчетыВВалюте Тогда
			СтрокаТаблицы.Валюта = СтрокаГрафика.ВалютаГрафик;
			СтрокаТаблицы.Курс = СтрокаГрафика.КурсГрафик;
		КонецЕсли;
		СтрокаТаблицы.ДокументАренды = СтрокаГрафика.ДокументГрафикиПлатежей;
		СтрокаТаблицы.ДокументАрендыПредставление = СтрокаГрафика.ДокументГрафикиПлатежейПредставление;
		СтрокаТаблицы.ДокументАрендыДата = СтрокаГрафика.ДокументГрафикиПлатежейДата;
		СтрокаТаблицы.ДокументАрендыНомер = СтрокаГрафика.ДокументГрафикиПлатежейНомер;
	КонецЕсли;

КонецПроцедуры

// Проверяет наличие графика платедей по договору
//
// Параметры:
//  ГрафикиПлатежей - см. НовыйГрафикиПлатежей
//  Отбор - Структура
//    Контрагент - СправочникСсылка.Контрагенты
//    ДоговорКонтрагента - СправочникСсылка.ДоговорыКонтрагентов
//  СтрокиГрафиков - массив строк из см. НовыйГрафикиПлатежей
//                 - Неопределено
Процедура ПроверитьНаличиеГрафикаПлатежей(ГрафикиПлатежей, Отбор, СтрокиГрафиков) Экспорт
	
	Если Не ЗначениеЗаполнено(ГрафикиПлатежей) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиГрафиков = ГрафикиПлатежей.НайтиСтроки(Отбор);
		
КонецПроцедуры

// Заполняет строку таблицы рассрочки долга данными графика
//
// Параметры:
//  СтрокаТаблицы - СтрокаТаблицыЗначений из см. КлассификацияЗадолженности.НовыйРассрочкаДолга()
//  СтрокиГрафиков - Массив из СтрокаТаблицыЗначений из см. РасчетПоказателейБалансаПоОбязательствамГрафики.НовыйГрафикиПлатежей
//                  - Неопределено - если Не ЕстьДисконтирование
//
Процедура ДополнитьСтрокуДаннымиИзГрафикаПоРассрочке(СтрокаТаблицы, СтрокиГрафиков) Экспорт
	
	// устанавливаем флаг, если у договора имеется график платежей
	СтрокаТаблицы.ЕстьГрафикПлатежей = Истина;
	
	КоличествоДокументов = 0;
	Обязательство12 = 0;
	ОбязательствоРуб12 = 0;
	ДатаПогашения = Дата(1,1,1);
	Для Каждого СтрокаГрафика Из СтрокиГрафиков Цикл
		КоличествоДокументов = КоличествоДокументов + 1;
		Обязательство12 = Обязательство12 + СтрокаГрафика.ОбязательствоГрафик12;
		ОбязательствоРуб12 = ОбязательствоРуб12 + СтрокаГрафика.ОбязательствоГрафикРуб12;
		Если ДатаПогашения < СтрокаГрафика.ДатаПогашения Тогда
			ДатаПогашения = СтрокаГрафика.ДатаПогашения;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаТаблицы.Обязательство12 = Обязательство12;
	СтрокаТаблицы.ОбязательствоРуб12 = ОбязательствоРуб12;
	СтрокаТаблицы.ДатаПогашения = ДатаПогашения;

	СтрокаГрафика = СтрокиГрафиков[0];

	Если КоличествоДокументов > 1 Тогда
		СтрокаТаблицы.НесколькоДокументовРассрочки = Истина;
	Иначе
		Если СтрокаТаблицы.РасчетыВВалюте Тогда
			СтрокаТаблицы.Валюта = СтрокаГрафика.ВалютаГрафик;
			СтрокаТаблицы.Курс = СтрокаГрафика.КурсГрафик;
		КонецЕсли;
		СтрокаТаблицы.ДокументУсловийРассрочки = СтрокаГрафика.ДокументГрафикиПлатежей;
		СтрокаТаблицы.ДокументУсловийРассрочкиПредставление = СтрокаГрафика.ДокументГрафикиПлатежейПредставление;
	КонецЕсли;

КонецПроцедуры

// Дополняет массив типами регистраторов из РегистрыСведений.ГрафикиПроцентныхРасходов
// Параметры:
//  Типы - Массив из Тип
//
Процедура ДобавитьТипыДокументовГрафикиПлатежей(Типы) Экспорт
	ТипыРегистраторов = Метаданные.РегистрыСведений.ГрафикиПроцентныхРасходов.СтандартныеРеквизиты.Регистратор.Тип.Типы();
	
	Для Каждого Тип Из ТипыРегистраторов Цикл
		Типы.Добавить(Тип);
	КонецЦикла;
		
КонецПроцедуры

// Заполняет шаблон расшифровки на начало периода для аренды (лизинга) в пояснении баланса "Обязательства"
// Параметры:
//  Шаблон - Строка
//
Процедура ЗаполнитьШаблонРасшифровкиПоАрендеПояснениеБалансаОбязательстваНачалоПериода(Шаблон) Экспорт
	
	Шаблон = НСтр("ru = 'Расчетное обязательство через 12 месяцев по графику процентных расходов на дату, следующую за [КонецПериода], в размере, не превышающем фактическое обязательство.
				|По договорам без графика платежей - отрицательное сальдо по [СчетуАренды] за вычетом относящегося к нему НДС (сальдо по кредиту [СчетаНДСАвансовВыданных]). Включаются суммы со сроком действия договора не ранее [СрокПогашенияНачало]
				|Расчет выполняется отдельно по каждому договору аренды (лизинга)[СуммарноПоФилиалам].'");
		
КонецПроцедуры

// Заполняет шаблон расшифровки на конец периода для аренды (лизинга) в пояснении баланса "Обязательства"
// Параметры:
//  Шаблон - Строка
//
Процедура ЗаполнитьШаблонРасшифровкиПоАрендеПояснениеБалансаОбязательстваКонецПериода(Шаблон) Экспорт
	
	Шаблон = НСтр("ru = 'Расчетное обязательство через 12 месяцев по графику процентных расходов на дату, следующую за [КонецСледующегоПериода], в размере, не превышающем фактическое обязательство.
				|По договорам без графика платежей - отрицательное сальдо по [СчетуАренды] за вычетом относящегося к нему НДС (сальдо по кредиту [СчетаНДСАвансовВыданных]). Включаются суммы со сроком действия договора не ранее [СрокПогашенияКонец]
				|Расчет выполняется отдельно по каждому договору аренды (лизинга)[СуммарноПоФилиалам].'");
				
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйГрафикиПлатежей()
	ТипСумма = БухгалтерскийУчетКлиентСервер.ТипСумма();
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Организация",                          Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("Контрагент",                           Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Таблица.Колонки.Добавить("ДоговорКонтрагента",                   Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	Таблица.Колонки.Добавить("РасчетыВВалюте",                       Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ДокументГрафикиПлатежей",              Новый ОписаниеТипов(РасчетПоказателейБалансаПоОбязательствам.ТипыДокументовГрафикиПлатежей()));
	Таблица.Колонки.Добавить("ДокументГрафикиПлатежейПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("ДокументГрафикиПлатежейДата",          Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("ДокументГрафикиПлатежейНомер",         ОбщегоНазначения.ОписаниеТипаСтрока(30));
	Таблица.Колонки.Добавить("ДатаПогашения",                        Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("ВалютаГрафик",                         Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Таблица.Колонки.Добавить("КурсГрафик",                           Метаданные.ОпределяемыеТипы.КурсВалюты.Тип);
	Таблица.Колонки.Добавить("ОбязательствоГрафик12",                ТипСумма);
	Таблица.Колонки.Добавить("ОбязательствоГрафикРуб12",             ТипСумма);
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти
